{
  "entries": [
    {
      "version": "1.0.4",
      "date": "2026-02-12",
      "title": "User Personas — content updates from stakeholder feedback",
      "changes": [
        {
          "type": "changed",
          "text": "Parent Outcomes: Reframed 'Context > constant monitoring' to 'Know what's happening & what to do next' — de-emphasize camera/why framing since camera isn't in v1. The baseline is always what happened + what to do; explaining why is an aspiration but not a blocker"
        },
        {
          "type": "changed",
          "text": "Parent Outcomes: Reframed 'Alerts, not streams' to emphasize background trust — Miles runs quietly in the background; it's not another thing to monitor and worry about. It surfaces what matters when it matters"
        },
        {
          "type": "added",
          "text": "Parent Outcomes: Added 'Vehicle peace of mind' as a new must-have outcome — parents want to head off costly maintenance issues before they escalate. Trusting a teen with car upkeep is stressful and expensive; Miles keeps them informed so nothing slips through the cracks"
        },
        {
          "type": "changed",
          "text": "Parent Visibility: Added trip-in-progress nuance — if a trip is in progress and parent opens the app, show real-time confirmation the trip is 'good' (status, key stats). But powerful summaries should naturally become the primary touchpoint over time; the app shouldn't feel like something to watch, but something to trust"
        },
        {
          "type": "changed",
          "text": "Parent Success: Added maintenance metric ('Head off costly maintenance issues before they escalate'). Added behavioral proxy metrics: decreasing frequency of parent opening the app within 15 min of a trip starting (indicates less anxiety), teen opens their score screen weekly, and teen shares a milestone (indicates trust being built)"
        },
        {
          "type": "added",
          "text": "Trust & Fairness (both personas): Added non-judgmental framing rule — information should be presented in an empowering way, not demotivating or judgmental. Added data privacy assurance — only parents and teen see data; confidence it won't be used against them, sold, or shared with third parties"
        },
        {
          "type": "added",
          "text": "Teen Triggers: Added 'check engine light or vehicle issue' as a trigger moment — teen should feel empowered, not helpless; know what's happening and what to do about it. Added 'demystify car ownership & maintenance' — build confidence around an unfamiliar responsibility"
        },
        {
          "type": "changed",
          "text": "Teen Outcomes: Moved 'Proof of innocence' (video evidence) to bottom of list with explicit future-phase note since it requires camera hardware. Promoted and strengthened 'Progress path' to top position — teen should know and feel confident they are improving; milestones lead to less oversight (earned independence); reduces anxiety and nerves about driving"
        },
        {
          "type": "added",
          "text": "Teen Trust & Fairness: Added parent-access phase ramp-down rule — parent sees more at the beginning, then access ramps down over time as trust is earned (phase model). This reinforces the 'trust ladder' concept from the parent persona"
        }
      ]
    },
    {
      "version": "1.0.3",
      "date": "2026-02-12",
      "title": "First Trip Journey — content updates from stakeholder feedback",
      "changes": [
        {
          "type": "changed",
          "text": "Step 1 – Setup (User Actions): Reordered so unbox comes first, then download app. Added billing/payment method collection early in the flow while user is still indoors — customers who purchased device + subscription on the website can bypass this step"
        },
        {
          "type": "added",
          "text": "Step 1 – Setup (User Actions): Added primary driver association as a required step — each device must have a primary driver, and trips are attributed to this driver unless told or detected otherwise. Added optional secondary drivers with 'send invite' capability, but invite acceptance is not required (important for SMB owners where the driver may not have app access)"
        },
        {
          "type": "added",
          "text": "Step 1 – Setup (Miles Actions): Miles now pulls vehicle data from OBD-II on plug-in (VIN, make/model, vehicle status, location, diagnostics) — gives instant feedback that the device is working and has contextual awareness of the car before the first trip even starts"
        },
        {
          "type": "added",
          "text": "Step 1 – Setup (Touchpoints): Added payment method collection, primary driver setup + secondary driver invites, and vehicle data confirmation screen (VIN, make/model, status) to touchpoint list"
        },
        {
          "type": "changed",
          "text": "Step 2 – Trigger (Miles Actions): Added OBD-II vehicle diagnostics and status data pull alongside trip recording"
        },
        {
          "type": "changed",
          "text": "Step 2 – Trigger (Opportunity): Rewrote to emphasize real-time accuracy as the key first-drive test — users will watch the live map closely to see if the dot is accurate and responsive. If there's lag or the position is off, it creates doubt about reliability. These early 'live' moments are a big test; users tend to watch drives more at the beginning then taper off"
        },
        {
          "type": "changed",
          "text": "Step 3 – Interpretation (User Goal): Changed from 'Have Miles correctly understand this was a trip with clean boundaries' to 'Understand how Miles works. Get confidence that Miles is accurate and working quietly in the background'"
        },
        {
          "type": "changed",
          "text": "Step 4 – Action (Touchpoints): Added push notification on first trip completion (and possibly a few early drives). Added prompt to customize alert preferences with options: alert for every drive, alert only for drives with issues (driving events, vehicle issues), or no alert with daily/weekly email summary instead — per-trip alerts will get annoying quickly so customization should be prompted early"
        },
        {
          "type": "changed",
          "text": "Step 4 – Action (Emotion): Shifted from 'Neutral patience' to 'Curious / Interested' — ideally the trip was accurate, they're surprised by how simple it was, interested to see their data, and confident Miles captured it correctly. This leads them to wonder what else Miles can do"
        },
        {
          "type": "changed",
          "text": "Step 4 – Action (Pain Point): Sharpened to focus on trip summary accuracy as the biggest trust-buster — if the first result doesn't match what they just drove, confidence drops immediately. Must nail this"
        },
        {
          "type": "added",
          "text": "Step 5 – Resolution (User Actions + Miles Actions): Added option to reassign/associate a different driver with the trip from the trip detail screen"
        },
        {
          "type": "added",
          "text": "Step 6 – Follow Up (Miles Actions): Added prompts for continued setup and customization — show setup completion status on app dashboard so users see what's left to do. Surface naturally so users understand that investing a little effort (naming locations, etc.) unlocks more value from Miles"
        },
        {
          "type": "added",
          "text": "Step 6 – Follow Up (Future Consideration): Added parental access ramp-down concept for discussion — Phase 0 (Driver's Training): parent sees everything, Miles logs training hours and produces report. Phase 1 (First 90 Days): parent sees trip-level summaries, gets more alerts, driver score generated at end. Phase 2 (Good Record Sustained): parent sees weekly rollups, teen gets more granular control. Phase 3: teen can request 'independence mode.' Not overly strict — a recommended path with milestones to encourage sticking with it"
        }
      ]
    },
    {
      "version": "1.0.2",
      "date": "2026-01-26",
      "title": "Style tiles + palette refresh",
      "changes": [
        {
          "type": "changed",
          "text": "Updated the secondary (sand) color ramp values in tokens."
        },
        {
          "type": "changed",
          "text": "Refined style tiles layout with full-bleed backgrounds and theme-specific overrides for hero, blog, and signup tiles."
        },
        {
          "type": "changed",
          "text": "Adjusted primary/tertiary button colors and hover states for better consistency across themes."
        },
        {
          "type": "removed",
          "text": "Simplified the color palette page by removing UI states and recommended color pairing sections."
        },
        {
          "type": "changed",
          "text": "Updated green logo assets (badge, icon, wordmark) in the styleguide."
        }
      ]
    },
    {
      "version": "1.0.1",
      "date": "2026-01-17",
      "title": "Change Log",
      "changes": [
        {
          "type": "added",
          "text": "Change Log"
        }
      ]
    },
    {
      "version": "1.0.0",
      "date": "2026-01-17",
      "title": "Initial Release",
      "changes": [
        {
          "type": "added",
          "text": "Brand color palette with primary, secondary, and neutral colors"
        },
        {
          "type": "added",
          "text": "Typography scale with Inter and Acme Gothic fonts"
        },
        {
          "type": "added",
          "text": "Logo variants (badge, wordmark, icon) in multiple colors"
        },
        {
          "type": "added",
          "text": "Image style guidelines with scene examples"
        },
        {
          "type": "added",
          "text": "Style tiles showing brand elements in context"
        },
        {
          "type": "added",
          "text": "Changelog page for tracking styleguide updates"
        }
      ]
    }
  ]
}